src/DataProcessors/ПрикреплениеОткреплениеГоловногоКонтрагента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ПрикреплениеОткреплениеГоловногоКонтрагента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Режим</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/ПрикреплениеОткреплениеГоловногоКонтрагента/Forms/ФормаУпр/Ext/Form/Module.bsl
//Валиахметов 09.04.2019 http://jira.part-kom.ru/browse/XX-2115
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьРеквизитыФормы();
	ЗаполнитьТЧ();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ГоловнойКонтрагентПриИзменении(Элемент)
	ЗаполнитьРеквизитыФормы();
КонецПроцедуры

&НаКлиенте
Процедура РежимПриИзменении(Элемент)
	УстановитьДоступностьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьВидимость()
	Элементы.ГруппаОсн.Видимость = Объект.Режим = 0;	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ЗаполнитьРеквизитыФормы();
	ЗаполнитьТЧ();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыФормы()
	ИННСовпадают = Объект.Контрагент.ИНН = Объект.ГоловнойКонтрагент.ИНН;
	ВидыОплатСовпадаютВОсновныхДоговорах = Объект.Контрагент.ОсновнойДоговорКонтрагента.ВидОплаты =  Объект.ГоловнойКонтрагент.ОсновнойДоговорКонтрагента.ВидОплаты;
	ОрганизацииСовпадаютВОсновныхДоговорах = Объект.Контрагент.ОсновнойДоговорКонтрагента.Организация =  Объект.ГоловнойКонтрагент.ОсновнойДоговорКонтрагента.Организация;
	
	
	//Для Каждого СтрокаТЧ Из РеализацииВСтатусеСборка Цикл 
	//КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧ()
	Если  ЗначениеЗаполнено(Объект.Контрагент) Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	РеализацияТоваровУслуг.Ссылка КАК Документ
		               |ИЗ
		               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		               |ГДЕ
		               |	РеализацияТоваровУслуг.Проведен
		               |	И РеализацияТоваровУслуг.СтатусДокумента = &СтатусДокументаСборка
		               |	И РеализацияТоваровУслуг.Контрагент = &Контрагент";
		Запрос.УстановитьПараметр("СтатусДокументаСборка", Справочники.СтатусыДокументов.РеализацияТоваровУслугСборка);
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		
		РеализацииВСтатусеСборка.Загрузить(Запрос.Выполнить().Выгрузить());
	Иначе
		РеализацииВСтатусеСборка.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПрименитьИзмененияНаСервере()
	лКлючАлгоритма = "Обработка_ПрикреплениеОткреплениеГоловногоКонтрагента_ПрименитьИзмененияНаСервере";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;

	Отказ = Ложь;
	Отказ = Не ПроверитьЗаполнение();
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Об = Объект.Контрагент.ПолучитьОбъект();
	Если Объект.Режим = 1 Тогда 
		Если Объект.Контрагент.ГоловнойКонтрагент = Объект.Контрагент Тогда
			Сообщить("У контрагента нет головного, окрепление не требуется");
			Возврат;
		Иначе
			Колво = 0;
			Для Каждого СтрокаТЧ Из РеализацииВСтатусеСборка Цикл 
				ДокОбъект = СтрокаТЧ.Документ.ПолучитьОбъект();
				ДокОбъект.КонтрагентВзаиморасчетов = Объект.Контрагент;
				ДокОбъект.ДоговорКонтрагентаВзаиморасчетов = Объект.Контрагент.ОсновнойДоговорКонтрагента;
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Колво = Колво + 1;
				Сообщить("Обработано документов:" + Колво);
			КонецЦикла;

			Об.ГоловнойКонтрагент = Объект.Контрагент;
			Об.Записать();
		КонецЕсли;
	Иначе
		Если Не ИННСовпадают Тогда 
			Сообщить("ИНН должны совпадать у контрагента и головного контрагента");
			Отказ = Истина;
		КонецЕсли;
		Если Не ВидыОплатСовпадаютВОсновныхДоговорах Тогда 
			Сообщить("Вид оплаты должны совпадать в основных договорах контрагента и головного контрагента");
			Отказ = Истина;
		КонецЕсли;
		Если Не ОрганизацииСовпадаютВОсновныхДоговорах Тогда 
			Сообщить("Организация должны совпадать в основных договорах контрагента и головного контрагента");
			Отказ = Истина;
		КонецЕсли;
		Если Не Отказ Тогда 
			Колво = 0;
			Для Каждого СтрокаТЧ Из РеализацииВСтатусеСборка Цикл 
				ДокОбъект = СтрокаТЧ.Документ.ПолучитьОбъект();
				ДокОбъект.КонтрагентВзаиморасчетов = Объект.ГоловнойКонтрагент;
				ДокОбъект.ДоговорКонтрагентаВзаиморасчетов = Объект.ГоловнойКонтрагент.ОсновнойДоговорКонтрагента;
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Колво = Колво + 1;
				Сообщить("Обработано документов:" + Колво);
			КонецЦикла;
			
			Об.ГоловнойКонтрагент = Объект.ГоловнойКонтрагент;
			Об.Записать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьИзменения(Команда)
	ПрименитьИзмененияНаСервере();
КонецПроцедуры
//Конец Валиахметов 09.04.2019 http://jira.part-kom.ru/browse/XX-2115
